# Data Processing - 2
## 열 기준 병합

In [1]:
# 패키지 참조

from hossam import load_data
from pandas import DataFrame
from pandas import merge

### 준비작업

In [3]:
# 샘플 데이터

고객 = load_data('customer_no_name')
고객

[data] https://data.hossam.kr/data/lab04/customer-no-name.xlsx
[desc] 데이터프레임 병합 실습을 위한 고객번호와 고객 이름에 대한 가상 데이터(인덱스와 메타데이터 없음)
[!] Cannot read metadata

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [4]:
# 샘플 데이터

매출 = load_data('customer_no_pay')
매출

[data] https://data.hossam.kr/data/lab04/customer-no-pay.xlsx
[desc] 데이터프레임 병합 실습을 위한 고객번호와 매출액에 대한 가상 데이터(인덱스와 메타데이터 없음)
[!] Cannot read metadata

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

### 열 기준 병합

In [5]:
merge(고객, 매출)

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [6]:
merge(고객, 매출, how = 'left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [7]:
merge(고객, 매출, how ='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1005   희동   15000
3  1006  마이콜    5000
4  1008  NaN  100000
5  1001   둘리   30000

### 병합 기준 열 지정하기

In [11]:
# 샘플 데이터 가져오기
cd1 = load_data('customer_data1')
print(cd1)

cd2 = load_data('customer_data2')
print(cd2)

[data] https://data.hossam.kr/data/lab04/customer_data1.xlsx
[desc] 데이터 병합용 실습 데이터 (1) (인덱스/메타데이터 없음)
[!] Cannot read metadata
  고객명         날짜     데이터
0  민수 2018-01-01   20000
1  수영 2018-01-01  100000
[data] https://data.hossam.kr/data/lab04/customer_data2.xlsx
[desc] 데이터 병합용 실습 데이터 (2) (인덱스/메타데이터 없음)
[!] Cannot read metadata
  고객명  데이터
0  민수  21세
1  수영  20세

### 병합 기준 열 지정하기 (On을 활용하여)

In [13]:
# 데이터 타입 다를때 병합 x
# On 파라미터 활용하여 열 지정

tmp = merge(cd1, cd2, on = '고객명')
tmp

  고객명         날짜   데이터_x 데이터_y
0  민수 2018-01-01   20000   21세
1  수영 2018-01-01  100000   20세

In [17]:
# 컬럼 이름이 모두 다른 경우
# 직접 설정

df_left = DataFrame({'이름': ['영희','철수'], '국어': [87, 91]})
print(df_left)
print('*'* 50)
df_right = DataFrame({'성명': ['영희', '철수'], '영어': [90, 82]})
print(df_right)

r1 = merge(df_left, df_right, left_on = ['이름'], right_on = ['성명'])
r1

   이름  국어
0  영희  87
1  철수  91
**************************************************
   성명  영어
0  영희  90
1  철수  82

   이름  국어  성명  영어
0  영희  87  영희  90
1  철수  91  철수  82

### 인덱스를 활용한 병합

In [19]:
df_left = DataFrame({'수학': [90, 82]}, index = ['민철', '봉구'])
df_left

    수학
민철  90
봉구  82

In [20]:
df_right = DataFrame({'국어': [90, 82]}, index = ['민철', '철수'])
df_right

    국어
민철  90
철수  82

In [21]:
# index 활용하여 INNER JOIN 하기

merge(df_left, df_right, left_index = True, right_index = True)

    수학  국어
민철  90  90

In [22]:
# index 활용하여 LEFT Outer JOIN 하기
merge(df_left, df_right, left_index = True, right_index = True, how = 'left')

    수학    국어
민철  90  90.0
봉구  82   NaN

In [23]:
# index 활용하여 RIGHT Outer JOIN 하기
merge(df_left, df_right, left_index = True, right_index = True, how = 'right')

      수학  국어
민철  90.0  90
철수   NaN  82

In [25]:
# index 활용하여 Full Outer Join하기
merge(df_left, df_right, left_index = True, right_index = True, how = 'outer')

      수학    국어
민철  90.0  90.0
봉구  82.0   NaN
철수   NaN  82.0

### 인덱스 + 칼럼 각각 기준으로 하기

In [28]:
df_left = DataFrame({'수학': [90, 82]}, index = ['민철', '봉구'])
print(df_left)

df_right = DataFrame({'성명': ['민철', '철수'], '영어' : [90, 82]})
print(df_right)

    수학
민철  90
봉구  82
   성명  영어
0  민철  90
1  철수  82

In [29]:
# 왼쪽은 인덱스, 오른쪽은 칼럼 기준으로 정렬 하기

merge(df_left,df_right, left_index = True, right_on = ['성명'])

   수학  성명  영어
0  90  민철  90

In [ ]:
# 왼쪽은 인덱스, 오른쪽은 칼럼 기준으로 Left Outer Join 정렬 하기

merge(df_left,df_right, left_index = True, right_on = ['성명'], how = 'left')

     수학  성명    영어
0.0  90  민철  90.0
NaN  82  봉구   NaN

In [31]:
# 왼쪽은 인덱스, 오른쪽은 칼럼 기준으로 Right Outer Join정렬 하기

merge(df_left,df_right, left_index = True, right_on = ['성명'], how = 'right')

     수학  성명  영어
0  90.0  민철  90
1   NaN  철수  82

In [33]:
# 왼쪽은 인덱스, 오른쪽은 칼럼 기준으로 Full Outer Join정렬 하기

tmp = merge(df_left,df_right, left_index = True, right_on = ['성명'], how = 'outer')
tmp

       수학  성명    영어
0.0  90.0  민철  90.0
NaN  82.0  봉구   NaN
1.0   NaN  철수  82.0

In [34]:
# 병합 후 인덱스 정리 필수

tmp2 = tmp.set_index('성명')
tmp2

      수학    영어
성명
민철  90.0  90.0
봉구  82.0   NaN
철수   NaN  82.0

In [29]:
import numpy as np
import pandas as pd
from pandas import merge
from hossam import load_data
from pandas import DataFrame
from sklearn.impute import SimpleImputer
from matplotlib import pyplot as plt

### 연습문제

In [30]:
df1 = load_data('order_history')
print(df1)
df1.info()

[data] https://data.hossam.kr/data/lab04/order_history.xlsx
[desc] 신입 데이터 분석가를 위한 실전 미션!

field        description
-----------  -------------
purchase_id  일련번호
customer_id  고객번호
item         상품명
price        금액

             customer_id             item   price
purchase_id
1                    101           Laptop  1200.0
2                    102            Mouse    25.0
3                    103         Keyboard     NaN
4                    101          Monitor   300.0
5                    104           Webcam  5000.0
6                    102          USB Hub    30.0
7                    105           Laptop  1100.0
8                    103            Mouse     NaN
9                    101     External HDD    80.0
10                   106  Docking Station   150.0
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, 1 to 10
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  10 non-null     int64
 1   item         10 non-null     object
 2   price        8 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 320.0+ bytes

In [31]:
customer_history =({
                    'customer_id': [101, 102, 103, 104, 105, 106],
                    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve','Frank'],
                    'age': [25, 32, 45, 38, 29, 41] 
})
df2 = DataFrame(customer_history)
df2

   customer_id     name  age
0          101    Alice   25
1          102      Bob   32
2          103  Charlie   45
3          104    David   38
4          105      Eve   29
5          106    Frank   41

In [32]:
df0 = df1.copy()
df0 = df0.fillna(value = df0['price'].mean())
df0

             customer_id             item     price
purchase_id
1                    101           Laptop  1200.000
2                    102            Mouse    25.000
3                    103         Keyboard   985.625
4                    101          Monitor   300.000
5                    104           Webcam  5000.000
6                    102          USB Hub    30.000
7                    105           Laptop  1100.000
8                    103            Mouse   985.625
9                    101     External HDD    80.000
10                   106  Docking Station   150.000

In [33]:
df3 = df0.copy()
median_price = df3['price'].median()
df3.loc[df3['price'] > 1000, 'price'] = median_price
df3

             customer_id             item     price
purchase_id
1                    101           Laptop  642.8125
2                    102            Mouse   25.0000
3                    103         Keyboard  985.6250
4                    101          Monitor  300.0000
5                    104           Webcam  642.8125
6                    102          USB Hub   30.0000
7                    105           Laptop  642.8125
8                    103            Mouse  985.6250
9                    101     External HDD   80.0000
10                   106  Docking Station  150.0000

In [36]:
df4 = merge(df3, df2, on = 'customer_id')
df4

   customer_id             item     price     name  age
0          101           Laptop  642.8125    Alice   25
1          102            Mouse   25.0000      Bob   32
2          103         Keyboard  985.6250  Charlie   45
3          101          Monitor  300.0000    Alice   25
4          104           Webcam  642.8125    David   38
5          102          USB Hub   30.0000      Bob   32
6          105           Laptop  642.8125      Eve   29
7          103            Mouse  985.6250  Charlie   45
8          101     External HDD   80.0000    Alice   25
9          106  Docking Station  150.0000    Frank   41

In [38]:
df5 = df4.astype({'customer_id': 'str'})
df5

  customer_id             item     price     name  age
0         101           Laptop  642.8125    Alice   25
1         102            Mouse   25.0000      Bob   32
2         103         Keyboard  985.6250  Charlie   45
3         101          Monitor  300.0000    Alice   25
4         104           Webcam  642.8125    David   38
5         102          USB Hub   30.0000      Bob   32
6         105           Laptop  642.8125      Eve   29
7         103            Mouse  985.6250  Charlie   45
8         101     External HDD   80.0000    Alice   25
9         106  Docking Station  150.0000    Frank   41